Repository: lifedever/file-lens
Catalog: FileLens/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# empty.title
source: Welcome to FileLens
zh_hans: 欢迎使用 FileLens

# empty.lead
source: Pick any folder (Downloads, Desktop…) and FileLens will tag the files inside by type — installers, screenshots, large files, and more. Your files stay where they are.
zh_hans: 选一个你常用的文件夹（比如 Downloads、Desktop），FileLens 会按规则自动归类——安装包、截图、大文件…… 文件物理位置不会改变，FileLens 只是按规则重新组织它们。

# empty.feat1.title
source: Auto-tag
zh_hans: 自动归类

# empty.feat1.body
source: 13 built-in rules cover most file types out of the box.
zh_hans: 13 条内置规则覆盖常见文件，开箱即用。

# empty.feat2.title
source: Never moves files
zh_hans: 不动你的文件

# empty.feat2.body
source: Original files stay in place. Only “Move to Trash” changes anything.
zh_hans: 文件始终在原文件夹，只有「移到废纸篓」才会动。

# empty.feat3.title
source: Live updates
zh_hans: 实时更新

# empty.feat3.body
source: New downloads appear automatically with the right tags.
zh_hans: 新下载的文件自动出现，按规则自动归类。

# empty.cta
source: Pick a Folder to Watch
zh_hans: 选择要监听的文件夹

# empty.hint
source: Tip: ⌘O · Recommended starting point: ~/Downloads
zh_hans: 小提示：⌘O 也能调出选择器 · 推荐先试试 Downloads 文件夹

# picker.title.format
source: Set up rules for “%@”
zh_hans: 为「%@」配置规则

# picker.subtitle
source: FileLens will scan this folder and tag each file by these rules. You can change anything later in the sidebar.
zh_hans: FileLens 会扫描这个文件夹，按下面的规则自动给每个文件归类。所有规则之后都能在侧栏修改 / 关闭。

# picker.recommendation
source: Not sure? Just click “Use these rules”. The defaults work for most folders, and you can always tweak them later.
zh_hans: 不知道选什么？直接点【使用这些规则】就行。默认配置对大多数场景够用，之后随时能改。

# picker.selected.format
source: %d of %d selected
zh_hans: 已选 %d / %d

# picker.confirm
source: Use these rules
zh_hans: 使用这些规则

# rule.Installers.desc
source: .dmg, .pkg, .app
zh_hans: .dmg / .pkg / .app 安装文件

# rule.Images.desc
source: png, jpg, heic, gif, webp…
zh_hans: png / jpg / heic / gif 等图片

# rule.Videos.desc
source: mp4, mov, mkv…
zh_hans: mp4 / mov / mkv 等视频

# rule.Audio.desc
source: mp3, m4a, wav, flac…
zh_hans: mp3 / m4a / wav 等音频

# rule.PDF.desc
source: .pdf files
zh_hans: .pdf 文件

# rule.Documents.desc
source: Word / Excel / PowerPoint / Pages / Numbers / txt / md
zh_hans: Word / Excel / PPT / Pages / Numbers / txt / md

# rule.Archives.desc
source: zip, rar, 7z, tar, gz…
zh_hans: zip / rar / 7z / tar 等压缩包

# rule.Code.desc
source: source / config (.swift, .py, .json…)
zh_hans: 源代码 / 配置文件 (.swift, .py, .json…)

# rule.Screenshots.desc
source: filename starts with “Screenshot / CleanShot / 截屏”
zh_hans: 文件名以「截屏 / Screenshot / CleanShot」开头

# rule.Large.desc
source: larger than 500 MB
zh_hans: 超过 500 MB 的文件

# rule.NewArrivals.desc
source: added in the last 7 days
zh_hans: 最近 7 天内加入的

# rule.Stale.desc
source: untouched for more than 30 days
zh_hans: 超过 30 天没动过的，可考虑清理

# rule.Downloading.desc
source: browser downloads in progress (.crdownload, .part…)
zh_hans: 浏览器还在下载中的临时文件 (.crdownload 等)

# kind.image
source: Image
zh_hans: 图片

# kind.movie
source: Movie
zh_hans: 视频

# kind.audio
source: Audio
zh_hans: 音频

# kind.archive
source: Archive
zh_hans: 压缩包

# kind.code
source: Code
zh_hans: 代码

# kind.document
source: Document
zh_hans: 文档

# kind.text
source: Text
zh_hans: 文本

# kind.other
source: Other
zh_hans: 其他

# bucket.today
source: Today
zh_hans: 今天

# bucket.yesterday
source: Yesterday
zh_hans: 昨天

# bucket.last3
source: Past 3 Days
zh_hans: 过去 3 天

# bucket.last7
source: Past 7 Days
zh_hans: 过去 7 天

# bucket.last15
source: Past 15 Days
zh_hans: 过去 15 天

# bucket.lastMonth
source: Past Month
zh_hans: 过去 1 个月

# bucket.last3Months
source: Past 3 Months
zh_hans: 过去 3 个月

# bucket.last6Months
source: Past 6 Months
zh_hans: 过去 6 个月

# bucket.lastYear
source: Past Year
zh_hans: 过去 1 年

# bucket.older
source: Earlier
zh_hans: 更早

source: All files
zh_hans: 全部文件

source: Open
zh_hans: 打开

source: Untitled
zh_hans: 未命名

source: is
zh_hans: 等于

source: is any of
zh_hans: 属于其一

source: is not
zh_hans: 不等于

source: contains
zh_hans: 包含

source: matches regex
zh_hans: 匹配正则

source: starts with
zh_hans: 以...开头

source: ends with
zh_hans: 以...结尾

source: greater than
zh_hans: 大于

source: less than
zh_hans: 小于

source: between
zh_hans: 介于

source: in the last N days
zh_hans: 最近 N 天内

source: not in the last N days
zh_hans: 不在最近 N 天内

source: before
zh_hans: 早于

source: after
zh_hans: 晚于

source: Delete Rule
zh_hans: 删除规则

source: Add Rule
zh_hans: 添加规则

# delete.confirm.title
source: Delete this rule?
zh_hans: 确定删除这条规则吗？

# delete.confirm.message
source: Files keep any other tags they have. The rule will be removed from this workspace.
zh_hans: 其他规则不受影响，这条规则会从当前文件夹移除。

# delete.confirm.message.format
source: Files keep any other tags. The “%@” rule will be removed from this workspace.
zh_hans: 其他规则不受影响，「%@」规则会从当前文件夹移除。

source: General
zh_hans: 通用

source: About
zh_hans: 关于

source: Auto-expand inspector when selecting a file
zh_hans: 选中文件时自动展开右侧详情栏

source: Appearance
zh_hans: 外观

# appearance.system
source: Follow System
zh_hans: 跟随系统

# appearance.light
source: Light
zh_hans: 浅色

# appearance.dark
source: Dark
zh_hans: 深色

source: Language
zh_hans: 语言

# language.system
source: System Default
zh_hans: 跟随系统

# language.restart.title
source: Restart required
zh_hans: 需要重启 FileLens

# language.restart.message
source: Switching languages takes effect after FileLens restarts.
zh_hans: 切换语言需要重启 FileLens 才能生效。

source: Restart Now
zh_hans: 立即重启

source: Check for Updates
zh_hans: 检查更新

source: Check for Updates…
zh_hans: 检查更新…

# menu.newRuleIn.format
source: New Rule in “%@”…
zh_hans: 在「%@」中新建规则…

# update.available.title
source: Update Available
zh_hans: 有新版本

# update.available.message.format
source: A new version %@ is available.
zh_hans: 检测到新版本 %@。

# update.download
source: Download…
zh_hans: 下载…

# update.uptodate
source: You're on the latest version.
zh_hans: 已是最新版本。

source: Sponsor
zh_hans: 赞助

# about.tagline
source: A non-destructive view layer for any folder. Files stay where they are.
zh_hans: 为任何文件夹加一层非破坏性的规则视图。 文件本身从不被移动。

source: Disable
zh_hans: 禁用

source: Enable
zh_hans: 启用

source: Rule name
zh_hans: 规则名称

source: value
zh_hans: 值

source: Installers
zh_hans: 安装包

source: Images
zh_hans: 图片

source: Videos
zh_hans: 视频

source: Audio
zh_hans: 音频

source: Documents
zh_hans: 文档

source: Archives
zh_hans: 压缩包

source: Code
zh_hans: 代码

source: Screenshots
zh_hans: 截图

source: Large files
zh_hans: 大文件

source: New arrivals
zh_hans: 新加入

source: Stale
zh_hans: 长期未动

source: Downloading
zh_hans: 下载中

source: Add Folder
zh_hans: 添加文件夹

source: Add Folder…
zh_hans: 添加文件夹…

source: Add a folder to get started
zh_hans: 先添加一个文件夹

source: FileLens watches folders you choose and groups files by tags. Files never move from their original location.
zh_hans: FileLens 监听你选定的文件夹，按规则分组展示。 文件始终留在原处，不会被移动。

# Workspaces
source: Folders
zh_hans: 文件夹

source: Tags
zh_hans: 规则

source: System
zh_hans: 系统

source: Uncategorized
zh_hans: 无标签

source: Trashed
zh_hans: 已删除

source: Reveal in Finder
zh_hans: 在 Finder 中显示

source: Open With Default App
zh_hans: 用默认 App 打开

source: Quick Look
zh_hans: 快速查看

source: Move to Trash
zh_hans: 移到废纸篓

source: Add Tag
zh_hans: 添加标签

source: Remove Tag
zh_hans: 移除标签

source: New Tag…
zh_hans: 新建标签…

source: Edit Rule…
zh_hans: 编辑规则…

source: New Rule…
zh_hans: 新建规则…

source: Choose default tags
zh_hans: 选择默认规则

source: FileLens groups files by these rules. You can turn any of them off later.
zh_hans: FileLens 会根据这些规则给文件归类。任何一项之后都可以关闭。

source: Cancel
zh_hans: 取消

source: Add
zh_hans: 添加

source: Save
zh_hans: 保存

source: Delete
zh_hans: 删除

source: Edit Rule
zh_hans: 编辑规则

source: New rule
zh_hans: 新建规则

source: Edit built-in rule
zh_hans: 编辑内置规则

source: Edit rule
zh_hans: 编辑规则

source: Name
zh_hans: 名称

source: Match
zh_hans: 匹配

source: All conditions
zh_hans: 全部条件

source: Any condition
zh_hans: 任一条件

source: Enabled
zh_hans: 启用

source: Conditions
zh_hans: 条件

source: Add Condition
zh_hans: 添加条件

source: No tags
zh_hans: 无标签

source: No selection
zh_hans: 未选中

source: Select a workspace from the sidebar
zh_hans: 从侧栏选择一个文件夹

source: Kind
zh_hans: 种类

source: Size
zh_hans: 大小

source: Date Added
zh_hans: 添加时间

source: Added
zh_hans: 添加于

source: Modified
zh_hans: 修改于

source: Location
zh_hans: 位置

source: View
zh_hans: 视图

source: Extension
zh_hans: 扩展名

source: Copy to…
zh_hans: 复制到…

source: Move to…
zh_hans: 移动到…

source: Copy Path
zh_hans: 复制路径

source: Rename…
zh_hans: 重命名…

source: Rename
zh_hans: 重命名

source: Share…
zh_hans: 共享…

source: Copy
zh_hans: 复制

source: Move
zh_hans: 移动

# dialog.rename.format
source: Enter a new name for “%@”.
zh_hans: 为「%@」输入一个新名字。

source: %lld of %lld selected
zh_hans: 已选 %lld / %lld

source: Color
zh_hans: 颜色

# palette.selection.count.format
source: %lld files selected
zh_hans: 已选 %lld 个文件

source: Support FileLens
zh_hans: 支持作者

source: Trash
zh_hans: 废纸篓

source: Unfiled
zh_hans: 未归档

source: Show Empty Rules
zh_hans: 显示空规则

source: Copied
zh_hans: 已复制

source: Copied %lld files
zh_hans: 已复制 %lld 个文件

source: Moved
zh_hans: 已移动

source: Moved %lld files
zh_hans: 已移动 %lld 个文件

source: Moved to Trash
zh_hans: 已移到废纸篓

# Moved to Trash %lld files
source: Moved %lld to Trash
zh_hans: 已移到废纸篓 %lld 个文件

# path.copied.single.format
source: Path copied: %@
zh_hans: 已复制路径：%@

# path.copied.multi.format
source: Copied %lld paths
zh_hans: 已复制 %lld 个路径

# shortcut.space
source: Space
zh_hans: 空格键

source: Renamed
zh_hans: 已重命名

source: Rule saved
zh_hans: 规则已保存

# empty.workspace.title
source: Select a workspace
zh_hans: 选择一个文件夹

# empty.workspace.subtitle
source: Pick a folder from the sidebar to see your tagged view.
zh_hans: 从侧栏选择一个文件夹，开始查看你的规则视图。

source: Shortcuts
zh_hans: 快捷键

# shortcut.openWindow.label
source: Open FileLens window
zh_hans: 打开 FileLens 主窗口

# welcome.title
source: Welcome to FileLens
zh_hans: 欢迎使用 FileLens

# welcome.tagline
source: Tag and organize any folder — without ever moving the original files.
zh_hans: 为任意文件夹按规则自动归类，永远不动你的原始文件。

# welcome.feature.nondestructive.title
source: Non-destructive view
zh_hans: 非破坏式视图

# welcome.feature.nondestructive.desc
source: Your files stay exactly where they are. Tags are only a view layer over the folder.
zh_hans: 文件位置不变，规则只是文件夹之上的一层视图。

# welcome.feature.rules.title
source: Smart auto-tagging
zh_hans: 智能自动归类

# welcome.feature.rules.desc
source: Match files by extension, name, size, or date. Tags update live as files arrive.
zh_hans: 按扩展名、名称、大小、日期定义规则，文件到来时实时归类。

# welcome.feature.workspaces.title
source: Watch any folder
zh_hans: 监听任意文件夹

# welcome.feature.workspaces.desc
source: Add Downloads, Documents, or any folder you choose. Each gets its own rules.
zh_hans: 可以添加 Downloads、Documents 或任何你选择的文件夹，每个都有独立的规则。

# welcome.feature.shortcuts.title
source: Native macOS feel
zh_hans: 原生 macOS 体验

# welcome.feature.shortcuts.desc
source: Quick Look, multi-select, drag-reorder, ⌘K menu, and a global hotkey.
zh_hans: 支持快速查看、多选、拖拽排序、⌘K 菜单和全局快捷键。

# welcome.getStarted
source: Get Started
zh_hans: 开始使用

# welcome.replay.label
source: Welcome screen
zh_hans: 欢迎页

# welcome.replay.button
source: Show Welcome…
zh_hans: 显示欢迎页…

# picker.selectAll
source: Select All
zh_hans: 全选

# picker.deselectAll
source: Deselect All
zh_hans: 取消全选

# update.uptodate.title
source: You're up to date
zh_hans: 已是最新版本

source: OK
zh_hans: 好

# settings.support
source: Support
zh_hans: 支持

# support.title
source: Support FileLens
zh_hans: 支持 FileLens

# support.subtitle
source: FileLens is free and open source. If it helps you, consider supporting the project.
zh_hans: FileLens 是免费开源的。如果对你有帮助，欢迎支持这个项目。

# support.coffee
source: Buy me a coffee
zh_hans: 请我喝杯咖啡

# support.star
source: Star on GitHub
zh_hans: GitHub 点个 Star

# support.feedback
source: Submit Feedback
zh_hans: 提交反馈

# about.website
source: Website
zh_hans: 官网

# workspace.remove…
source: Remove Workspace…
zh_hans: 移除此文件夹…

# workspace.remove
source: Remove
zh_hans: 移除

# workspace.remove.confirm.title
source: Remove this workspace?
zh_hans: 移除此文件夹?

# workspace.remove.confirm.message.format
source: Stop watching “%@”? Files on disk are untouched; only this folder is removed from FileLens.
zh_hans: 停止监听「%@」?磁盘上的文件不会动,只是把这个文件夹从 FileLens 中移除。

# settings.autoCheckUpdate
source: Check for updates automatically on launch
zh_hans: 启动时自动检查更新

# settings.section.indexing
source: Indexing
zh_hans: 索引

# settings.ignoreHidden
source: Skip hidden files (.DS_Store, etc.)
zh_hans: 跳过隐藏文件(.DS_Store 等)

# settings.exclude.label
source: Exclude rules
zh_hans: 排除规则

# settings.exclude.hint
source: Comma- or newline-separated names. Files and folders matching any name are skipped during indexing.
zh_hans: 用逗号或换行分隔。索引时会跳过名称匹配的文件或目录(目录会连带其全部内容跳过)。

# settings.days.unit
source: days
zh_hans: 天

# settings.section.workspaceDefaults
source: Workspace defaults
zh_hans: 新建文件夹默认

# settings.newArrivalsDays %lld
source: “New arrivals” window: %lld days
zh_hans: “新加入”窗口:%lld 天

# settings.staleDays %lld
source: “Stale” after: %lld days
zh_hans: “长期未动”阈值:%lld 天

# settings.thresholds.hint
source: Affects only newly added workspaces. Edit existing rules in the rule editor.
zh_hans: 仅影响新增的文件夹。已有文件夹的规则可在规则编辑器中单独修改。

# settings.section.config
source: Configuration
zh_hans: 配置

# settings.exportConfig
source: Export…
zh_hans: 导出…

# settings.importConfig
source: Import…
zh_hans: 导入…

# config.export.title
source: Export FileLens Configuration
zh_hans: 导出 FileLens 配置

# config.import.title
source: Import FileLens Configuration
zh_hans: 导入 FileLens 配置

# config.import.unsupportedVersion
source: This config file is from a newer FileLens. Please update the app first.
zh_hans: 此配置文件来自更新版本的 FileLens,请先升级 App 再导入。

# settings.importConfig.result.format
source: Imported %d new folder(s)
zh_hans: 已导入 %d 个新文件夹

# status.selected.format
source: %lld of %lld selected
zh_hans: 已选 %lld / %lld

# status.items.format
source: %lld items
zh_hans: %lld 项

# settings.preferences
source: Preferences
zh_hans: 偏好

# settings.newArrivalsDays.label
source: “New arrivals” window
zh_hans: “新加入”窗口

# settings.staleDays.label
source: “Stale” after
zh_hans: “长期未动”阈值

# settings.days.format
source: %lld days
zh_hans: %lld 天

# config.exported.format
source: Exported to %@
zh_hans: 已导出到 %@

# config.imported.none
source: Nothing to import (folders already exist)
zh_hans: 没有需要导入的内容（文件夹已存在）

# picker.recursive
source: Include subfolders
zh_hans: 包含子文件夹

# picker.recursive.hint
source: Off by default for shallow folders like Downloads
zh_hans: 默认关闭(Downloads 等浅目录适用)

# workspace.contextmenu.settings
source: Folder Settings…
zh_hans: 文件夹设置…

# workspace.contextmenu.reindex
source: Reindex Now
zh_hans: 立即重索引

# workspace.reindex.toast.start
source: Reindexing folder…
zh_hans: 正在重新索引文件夹…

# workspace.reindex.toast.done
source: Reindex complete
zh_hans: 重新索引完成

# workspace.settings.title
source: Folder Settings
zh_hans: 文件夹设置

# workspace.settings.displayName
source: Display name
zh_hans: 显示名称

# workspace.settings.path
source: Path
zh_hans: 路径

# workspace.settings.section.scope
source: Scan Scope
zh_hans: 扫描范围

# workspace.settings.recursive
source: Include subfolders (recursive)
zh_hans: 包含子文件夹（递归）

# workspace.settings.maxDepth
source: Max depth
zh_hans: 最大深度

# workspace.settings.includeFolders
source: Show folders as items
zh_hans: 在列表中显示文件夹

# kind.folder
source: Folder
zh_hans: 文件夹

source: Folders
zh_hans: 文件夹

# rule.Folders.desc
source: All folders. Double-click to open in Finder.
zh_hans: 所有文件夹。双击在 Finder 中打开。

# rule.condition.name.placeholder.contains
source: screenshot
zh_hans: 截图

# rule.condition.size.between.separator
source: to
zh_hans: 至

# rule.condition.date.daysSuffix
source: days
zh_hans: 天

# rule.condition.kind.empty
source: Choose kinds…
zh_hans: 选择种类…

# inspector.section.actions
source: Actions
zh_hans: 操作

# inspector.multiselect.format
source: %lld items selected
zh_hans: 已选 %lld 项

# trash.confirm.title.single.format
source: Move “%@” to the Trash?
zh_hans: 确定将「%@」移到废纸篓？

# trash.confirm.title.multi.format
source: Move %lld items to the Trash?
zh_hans: 确定将 %lld 项移到废纸篓？

# trash.confirm.body
source: You can restore them from the Trash later.
zh_hans: 之后可以从废纸篓中恢复。

# workspace.settings.maxDepth.placeholder
source: Unlimited
zh_hans: 无限制

# workspace.settings.scope.nonrecursive.hint
source: Only top-level files in the folder are indexed.
zh_hans: 仅索引文件夹顶层的文件。

# workspace.settings.scope.unlimited.hint
source: All subfolders, no depth limit.
zh_hans: 递归所有子文件夹，无深度限制。

# workspace.settings.scope.limited.hint.format
source: Subfolders up to %lld level(s) deep.
zh_hans: 递归子文件夹最多 %lld 层。

# workspace.settings.extraIgnore.label
source: Extra exclusions (this folder only)
zh_hans: 额外排除规则（仅此文件夹）

# workspace.settings.extraIgnore.hint
source: Comma- or newline-separated. Combined with the global exclusion list in Settings → Preferences.
zh_hans: 用逗号或换行分隔，与「设置 → 偏好」里的全局排除规则合并生效。

# workspace.settings.watchEnabled
source: Watch folder for changes
zh_hans: 监听文件夹变化

# workspace.settings.watchEnabled.hint
source: Off for network drives or huge folders. Reindex manually via right-click → Reindex Now.
zh_hans: 网络盘 / 巨大目录时关掉。需要刷新时通过右键 → 立即重索引。

# workspace.badge.recursive.unlimited
source: Recursive · all subfolders
zh_hans: 递归 · 所有子文件夹

# workspace.badge.recursive.limited.format
source: Recursive · up to %lld levels
zh_hans: 递归 · 最多 %lld 层
